package info.sunjune.solve.calculation.error;

/**
 * Error Check Information for Calculation Formula
 * <br>
 * ------------------------------------------------------------------
 * <br>
 * 计算公式检查错误信息
 * <br>
 * ------------------------------------------------------------------
 * <br>
 * 計算式のエラーチェック情報
 */
public enum FormulaError implements ErrorInfo {

    UNKNOWN,

    /**
     * Mismatched parentheses in the function.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 方法函数的包裹符不匹配
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * メソッド関数の括弧が一致しません。
     */
    INVALID_BRACKET_AFTER_FUNCTION,

    /**
     * Mismatched Operator Parentheses.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 运算包裹符不匹配
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 演算子の括弧が一致しません。
     */
    INVALID_BRACKET_IN_EXPRESSION,

    /**
     * Meaningless Operation Parentheses
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 无意义的运算包裹符
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 無意味な演算子の括弧
     */
    INVALID_BRACKET_POINTLESS,

    /**
     * An operation cannot begin with a closing parenthesis.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 运算不能以关闭包裹符开始
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 演算は閉じ括弧で始めることはできません。
     */
    START_WITH_CLOSE_BRACKET,

    /**
     * Missing Parameters
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 参数缺失
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * パラメータ不足
     */
    ARGUMENT_MISSING,

    /**
     * Unable to match the opening delimiter.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 无法匹配开始包裹符
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 開始括弧を一致させることができません。
     */
    INVALID_PARENTHESIS_MATCH_OPEN_BRACKET,

    /**
     * Cannot start the operation from an operator delimiter.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 无法从运算分割符,开始进行运算
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 演算子から演算を開始できません。
     */
    CAN_NOT_START_WITH_ARGUMENT_SEPARATOR,

    /**
     * The function method is not properly linked.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 函数方法没有被正确的链接
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 関数メソッドが正しくリンクされていません。
     */
    FUNCTION_MISSING,

    /**
     * Function parameters do not match.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 函数参数不匹配
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 関数のパラメータが一致しません。
     */
    FUNCTION_ARGUMENT_COUNT_ERROR,

    /**
     * The operators are not correctly linked.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 运算符没有被正确的链接
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 演算子が正しくリンクされていません。
     */
    OPERATOR_MISSING,

    /**
     * The value is not properly linked.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 值没有被正确的链接
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 値が正しくリンクされていません。
     */
    LITERAL_MISSING,

    /**
     * Value does not exist。
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 值不存在
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 値が存在しません
     */
    VALUE_DOES_NOT_EXIST,
}
