package info.sunjune.solve.calculation.error;

public enum StandardError implements ErrorInfo {

    /**
     * Operational parameters must be numbers.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 运算参数必须为数字
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 演算のパラメータは数字でなければなりません。
     */
    PARAMETERS_MUST_BE_NUMERIC,

    /**
     * Cannot perform division by zero.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 无法进行除以0的计算
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 0で割り算できません。
     */
    DIVISION_BY_ZERO,

    /**
     * There is an issue with the number of parameters.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 参数数量存在问题
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * パラメーターの数に問題があります。
     */
    INCORRECT_NUMBER_PARAMETERS,

    /**
     * The value exceeds the expected maximum.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 数值超过预期最大值
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 値が予想される最大値を超えています。
     */
    EXPECTED_MAXIMUM_VALUE,

    /**
     * Unknown Operator
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 未知的运算符
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 未知の演算子
     */
    UNKNOWN_OPERATOR,
}
