package info.sunjune.solve.calculation.calculator.item;

/**
 * Operation Type
 * <br>
 * ------------------------------------------------------------------
 * <br>
 * 运算类型
 * <br>
 * ------------------------------------------------------------------
 * <br>
 * 演算の種類
 */
public enum Kind {

    /**
     * Opening parentheses, such as ( for a method or ( for a wrapping operator.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 开始包裹符，比如方法的( 或者包裹运算符的(
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 開始括弧、例えばメソッドの（またはラップ演算子の（。
     */
    OPEN_BRACKET,

    /**
     * Close the enclosing parentheses, such as in a method ) or in a wrapping operation ).
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 关闭包裹符，比如方法的) 或者包裹运算符的 )
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 閉じる括弧、例えばメソッドの ）またはラップト操作の ）。
     */
    CLOSE_BRACKET,

    /**
     * Separator in function operations, default is: ,
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 函数运算中的分隔符，默认为： ,
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 関数の演算における区切り記号、デフォルトは：,
     */
    FUNCTION_SEPARATOR,

    /**
     * Calculate the function
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 计算函数
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 計算関数
     */
    FUNCTION,

    /**
     * General Operators
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 一般运算符
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 一般演算子
     */
    OPERATOR,

    /**
     * The monadic operator
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 单体操作符
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * モナド演算子
     */
    MONADIC_OPERATOR,

    /**
     * General values, e.g., 100, "str", other replaceable variables.
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 一般值，如：100, "str", 其他可替换变量
     * <br>
     * ------------------------------------------------------------------
     * <br>
     * 一般的な値、例：100、"str"、他の置換可能な変数。
     */
    LITERAL

}
